Tekla Open API Reference for Tekla Structures 2025
ShapeCatalog Methods
The ShapeCatalog type exposes the following members.
Methods
Name | Description
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
ShapeCatalog Class
Tekla.Structures.Dialog.UIControls Namespace